{
  "books": [
    {
      "title": "The Midnight Library",
      "author": "Matt Haig",
      "rating": 4.8,
      "reviews": 1250,
      "totalReviews": 1250,
      "image": "https://images.unsplash.com/photo-1544947950-fa07a98d237f?w=400&h=600&fit=crop",
      "genre": "Fiction",
      "description": "Between life and death there is a library, and within that library, the shelves go on forever. Every book provides a chance to try another life you could have lived.",
      "fullDescription": "A dazzling novel about all the choices that go into a life well lived, from the internationally bestselling author of Reasons to Stay Alive and How To Stop Time. Between life and death there is a library, and within that library, the shelves go on forever. Every book provides a chance to try another life you could have lived. To see how things would be if you had made other choices... Would you have done anything different, if you had the chance to undo your regrets? A novel about all the choices that go into a life well lived, The Midnight Library tells the story of Nora Seed, who finds herself faced with this decision.",
      "publishedYear": 2020,
      "pages": 288,
      "publisher": "Canongate Books",
      "language": "English",
      "isbn": "978-0525559474",
      "awards": ["Goodreads Choice Award for Fiction (2020)"],
      "themes": [
        "Philosophy",
        "Life Choices",
        "Regret",
        "Self-Discovery",
        "Mental Health"
      ],
      "readingTime": "4-6 hours",
      "difficulty": "Easy",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "The only way to learn is to live.",
        "Every life contains many millions of decisions. Some big, some small. But every time one decision is taken over another, the outcomes differ.",
        "It is not the lives we regret not living that are the real problem. It is the regret itself."
      ]
    },
    {
      "title": "Atomic Habits",
      "author": "James Clear",
      "rating": 4.9,
      "reviews": 2100,
      "totalReviews": 2100,
      "image": "https://images.unsplash.com/photo-1589829085413-56de8ae18c73?w=400&h=600&fit=crop",
      "genre": "Self-Help",
      "description": "An easy & proven way to build good habits & break bad ones.",
      "fullDescription": "No matter your goals, Atomic Habits offers a proven framework for improving--every day. James Clear, one of the world's leading experts on habit formation, reveals practical strategies that will teach you exactly how to form good habits, break bad ones, and master the tiny behaviors that lead to remarkable results. If you're having trouble changing your habits, the problem isn't you. The problem is your system. Bad habits repeat themselves again and again not because you don't want to change, but because you have the wrong system for change.",
      "publishedYear": 2018,
      "pages": 320,
      "publisher": "Avery",
      "language": "English",
      "isbn": "978-0735211292",
      "awards": ["New York Times Bestseller", "Wall Street Journal Bestseller"],
      "themes": [
        "Productivity",
        "Personal Development",
        "Psychology",
        "Success",
        "Motivation"
      ],
      "readingTime": "5-7 hours",
      "difficulty": "Easy",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "You do not rise to the level of your goals. You fall to the level of your systems.",
        "Every action you take is a vote for the type of person you wish to become.",
        "The most effective way to change your habits is to focus not on what you want to achieve, but on who you wish to become."
      ]
    },
    {
      "title": "The Seven Husbands of Evelyn Hugo",
      "author": "Taylor Jenkins Reid",
      "rating": 4.7,
      "reviews": 3200,
      "totalReviews": 3200,
      "image": "https://images.unsplash.com/photo-1481627834876-b7833e8f5570?w=400&h=600&fit=crop",
      "genre": "Historical Fiction",
      "description": "Reclusive Hollywood icon Evelyn Hugo finally decides to tell her life story—but only to one reporter.",
      "fullDescription": "Reclusive Hollywood icon Evelyn Hugo is finally ready to tell the truth about her glamorous and scandalous life. But when she chooses unknown magazine reporter Monique Grant for the job, no one is more astounded than Monique herself. Why her? Why now? Monique is not exactly on top of the world. Her husband has left her, and her career has stagnated. Regardless of why Evelyn has selected her to write her biography, Monique is determined to use this opportunity to jumpstart her career.",
      "publishedYear": 2017,
      "pages": 400,
      "publisher": "Atria Books",
      "language": "English",
      "isbn": "978-1501161933",
      "awards": ["Goodreads Choice Award Nominee"],
      "themes": ["Love", "Ambition", "Hollywood", "LGBTQ+", "Secrets", "Fame"],
      "readingTime": "6-8 hours",
      "difficulty": "Easy",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "People think that intimacy is about sex. But intimacy is about truth.",
        "When you realize you can tell someone your truth, when you can show yourself to them, when you can stand in front of them bare and their response is 'you're safe with me'—that's intimacy.",
        "You have to be ruthless with yourself, in order to be honest with yourself."
      ]
    },
    {
      "title": "Dune",
      "author": "Frank Herbert",
      "rating": 4.8,
      "reviews": 2890,
      "totalReviews": 2890,
      "image": "https://images.unsplash.com/photo-1446776653964-20c1d3a81b06?w=400&h=600&fit=crop",
      "genre": "Science Fiction",
      "description": "The epic space opera that started it all. Set on the desert planet Arrakis, it tells the story of Paul Atreides.",
      "fullDescription": "Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the 'spice' melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for... When House Atreides is betrayed, the destruction of Paul's family will set the boy on a journey toward a destiny greater than he could ever have imagined.",
      "publishedYear": 1965,
      "pages": 688,
      "publisher": "Chilton Books",
      "language": "English",
      "isbn": "978-0441172719",
      "awards": [
        "Hugo Award for Best Novel (1966)",
        "Nebula Award for Best Novel (1965)"
      ],
      "themes": [
        "Politics",
        "Religion",
        "Ecology",
        "Power",
        "Destiny",
        "Survival"
      ],
      "readingTime": "12-15 hours",
      "difficulty": "Hard",
      "ageRating": "Young Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "I must not fear. Fear is the mind-killer.",
        "He who controls the spice controls the universe.",
        "The beginning is a very delicate time."
      ]
    },
    {
      "title": "The Silent Patient",
      "author": "Alex Michaelides",
      "rating": 4.5,
      "reviews": 1890,
      "totalReviews": 1890,
      "image": "https://images.unsplash.com/photo-1543002588-bfa74002ed7e?w=400&h=600&fit=crop",
      "genre": "Mystery",
      "description": "A psychological thriller that will keep you guessing until the final page.",
      "fullDescription": "Alicia Berenson's life is seemingly perfect. A famous painter married to an in-demand fashion photographer, she lives in a grand house overlooking a park in one of London's most desirable areas. One evening her husband Gabriel returns home late from a fashion shoot, and Alicia shoots him five times in the face, and then never speaks another word. Alicia's refusal to talk, or give any kind of explanation, turns a domestic tragedy into something far grander, a mystery that captures the public imagination and casts Alicia into notoriety.",
      "publishedYear": 2019,
      "pages": 336,
      "publisher": "Celadon Books",
      "language": "English",
      "isbn": "978-1250301697",
      "awards": ["Goodreads Choice Award for Mystery & Thriller (2019)"],
      "themes": [
        "Psychology",
        "Mental Health",
        "Marriage",
        "Art",
        "Silence",
        "Truth"
      ],
      "readingTime": "5-7 hours",
      "difficulty": "Medium",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "Choosing a lover is a lot like choosing a therapist. We need to ask ourselves, is this someone who will be honest with me, listen to criticism, admit making mistakes, and not promise the impossible?",
        "We are all crazy in some way. The only difference is some of us are better at hiding it than others.",
        "That's what I love about art—it's the only place where you can be completely honest."
      ]
    },
    {
      "title": "Educated",
      "author": "Tara Westover",
      "rating": 4.8,
      "reviews": 2340,
      "totalReviews": 2340,
      "image": "https://images.unsplash.com/photo-1512820790803-83ca734da794?w=400&h=600&fit=crop",
      "genre": "Biography",
      "description": "A memoir about education, family, and the struggle for self-invention.",
      "fullDescription": "Tara Westover was seventeen the first time she set foot in a classroom. Born to survivalists in the mountains of Idaho, she prepared for the end of the world by stockpiling home-canned peaches and sleeping with her 'head-for-the-hills bag.' In the summer she stewed herbs for her mother, a midwife and healer, and in the winter she salvaged in her father's junkyard. Her father forbade hospitals, so Tara never saw a doctor or nurse. Gashes and concussions, even burns from explosions, were all treated at home with herbalism.",
      "publishedYear": 2018,
      "pages": 334,
      "publisher": "Random House",
      "language": "English",
      "isbn": "978-0399590504",
      "awards": [
        "Goodreads Choice Award for Memoir & Autobiography (2018)",
        "Alex Award (2019)"
      ],
      "themes": [
        "Education",
        "Family",
        "Religion",
        "Self-Discovery",
        "Abuse",
        "Resilience"
      ],
      "readingTime": "6-8 hours",
      "difficulty": "Medium",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "You can love someone and still choose to say goodbye to them.",
        "Everything I had worked for, all my years of study, had been to purchase for myself this one privilege: to see and experience more truths than those given to me by my father, and to use those truths to construct my own mind.",
        "I am not the child my father raised, but he is the father who raised her."
      ]
    },
    {
      "title": "Project Hail Mary",
      "author": "Andy Weir",
      "rating": 4.9,
      "reviews": 1670,
      "totalReviews": 1670,
      "image": "https://images.unsplash.com/photo-1446776653964-20c1d3a81b06?w=400&h=600&fit=crop",
      "genre": "Science Fiction",
      "description": "A lone astronaut must save the earth from disaster in this thrilling space adventure.",
      "fullDescription": "Ryland Grace is the sole survivor on a desperate, last-chance mission—and if he fails, humanity and the earth itself will perish. Except that right now, he doesn't know that. He can't even remember his own name, let alone the nature of his assignment or how to complete it. All he knows is that he's been asleep for a very, very long time. And he's just been awakened to find himself millions of miles from home, with nothing but two corpses for company.",
      "publishedYear": 2021,
      "pages": 496,
      "publisher": "Ballantine Books",
      "language": "English",
      "isbn": "978-0593135204",
      "awards": [
        "Goodreads Choice Award for Science Fiction (2021)",
        "Hugo Award Nominee"
      ],
      "themes": [
        "Science",
        "Friendship",
        "Sacrifice",
        "Problem-Solving",
        "Space Exploration",
        "Survival"
      ],
      "readingTime": "8-10 hours",
      "difficulty": "Medium",
      "ageRating": "Young Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "Sometimes a person just has to be brave.",
        "I peer into the darkness and wonder how many other forms of life are out there.",
        "The universe is a pretty big place. If it's just us, seems like an awful waste of space."
      ]
    },
    {
      "title": "The Love Hypothesis",
      "author": "Ali Hazelwood",
      "rating": 4.4,
      "reviews": 1120,
      "totalReviews": 1120,
      "image": "https://images.unsplash.com/photo-1518373714866-3f1478910cc0?w=400&h=600&fit=crop",
      "genre": "Romance",
      "description": "A contemporary romance set in academia with fake dating and real chemistry.",
      "fullDescription": "As a third-year Ph.D. candidate, Olive Smith doesn't believe in lasting romantic relationships--until her best friend falls head over heels for a man who must be off-limits. In a moment of panic, Olive kisses the first man she sees. That man is none other than Adam Carlsen, a young hotshot professor--and well-known ass. Which is why Olive is positively floored when Stanford's reigning lab tyrant agrees to keep her charade a secret and be her fake boyfriend.",
      "publishedYear": 2021,
      "pages": 352,
      "publisher": "Berkley",
      "language": "English",
      "isbn": "978-1984806130",
      "awards": ["Goodreads Choice Award Nominee for Romance (2021)"],
      "themes": [
        "Academia",
        "Fake Dating",
        "STEM",
        "Friendship",
        "Self-Worth",
        "Love"
      ],
      "readingTime": "5-7 hours",
      "difficulty": "Easy",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "I want to be someone's first choice. For once.",
        "You are my favorite person.",
        "I think I might have been a little in love with you since the moment you first rolled your eyes at me."
      ]
    },
    {
      "title": "Sapiens: A Brief History of Humankind",
      "author": "Yuval Noah Harari",
      "rating": 4.7,
      "reviews": 3200,
      "totalReviews": 3200,
      "image": "https://images.unsplash.com/photo-1481627834876-b7833e8f5570?w=400&h=600&fit=crop",
      "genre": "History",
      "description": "A brief history of humankind from the Stone Age to the present.",
      "fullDescription": "From a renowned historian comes a groundbreaking narrative of humanity's creation and evolution—a #1 international bestseller—that explores the ways in which biology and history have defined us and enhanced our understanding of what it means to be 'human.' One hundred thousand years ago, at least six different species of humans inhabited Earth. Yet today there is only one—homo sapiens. What happened to the others? And what may happen to us?",
      "publishedYear": 2014,
      "pages": 443,
      "publisher": "Harper",
      "language": "English",
      "isbn": "978-0062316097",
      "awards": ["National Academy of Sciences Communication Award"],
      "themes": [
        "Anthropology",
        "Evolution",
        "Civilization",
        "Technology",
        "Religion",
        "Future"
      ],
      "readingTime": "8-10 hours",
      "difficulty": "Medium",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "The real difference between us and chimpanzees is the mythical glue that binds together large numbers of individuals, families and groups.",
        "Culture tends to argue that it forbids only that which is unnatural. But from a biological perspective, nothing is unnatural.",
        "We study history not to predict the future, but to free ourselves of the past and imagine alternative destinies."
      ]
    },
    {
      "title": "The Thursday Murder Club",
      "author": "Richard Osman",
      "rating": 4.6,
      "reviews": 1450,
      "totalReviews": 1450,
      "image": "https://images.unsplash.com/photo-1544947950-fa07a98d237f?w=400&h=600&fit=crop",
      "genre": "Mystery",
      "description": "Four unlikely friends meet weekly to investigate cold cases in their retirement community.",
      "fullDescription": "In a peaceful retirement village, four unlikely friends meet weekly in the Jigsaw Room to discuss unsolved crimes; together they call themselves the Thursday Murder Club. When a local developer is found dead with a mysterious photograph left next to the body, the Thursday Murder Club suddenly find themselves in the middle of their first live case. As the bodies begin to pile up, can our unorthodox but brilliant gang catch the killer, before it's too late?",
      "publishedYear": 2020,
      "pages": 368,
      "publisher": "Pamela Dorman Books",
      "language": "English",
      "isbn": "978-0525557814",
      "awards": ["Crime Writers' Association Ian Fleming Steel Dagger"],
      "themes": [
        "Friendship",
        "Aging",
        "Community",
        "Justice",
        "Humor",
        "Investigation"
      ],
      "readingTime": "6-8 hours",
      "difficulty": "Easy",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "People live, and then they die, and that's it. The end. But while they're living, they should live properly.",
        "You can't arrest someone for being annoying, Joyce. If you could, the prisons would be even fuller than they already are.",
        "The thing about getting old is that you don't get old gradually. You just wake up one day and you're old."
      ]
    },
    {
      "title": "The Alchemist",
      "author": "Paulo Coelho",
      "rating": 4.5,
      "reviews": 4200,
      "totalReviews": 4200,
      "image": "https://images.unsplash.com/photo-1481627834876-b7833e8f5570?w=400&h=600&fit=crop",
      "genre": "Fiction",
      "description": "A magical story about following your dreams and listening to your heart.",
      "fullDescription": "Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, to follow our dreams.",
      "publishedYear": 1988,
      "pages": 163,
      "publisher": "HarperOne",
      "language": "English",
      "isbn": "978-0062315007",
      "awards": ["Corine International Award for Fiction"],
      "themes": [
        "Dreams",
        "Destiny",
        "Adventure",
        "Self-Discovery",
        "Spirituality",
        "Journey"
      ],
      "readingTime": "3-4 hours",
      "difficulty": "Easy",
      "ageRating": "Young Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "And, when you want something, all the universe conspires in helping you to achieve it.",
        "It's the possibility of having a dream come true that makes life interesting.",
        "When we love, we always strive to become better than we are."
      ]
    },
    {
      "title": "Where the Crawdads Sing",
      "author": "Delia Owens",
      "rating": 4.6,
      "reviews": 2800,
      "totalReviews": 2800,
      "image": "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?w=400&h=600&fit=crop",
      "genre": "Fiction",
      "description": "A coming-of-age story set in the marshlands of North Carolina.",
      "fullDescription": "For years, rumors of the 'Marsh Girl' have haunted Barkley Cove, a quiet town on the North Carolina coast. So in late 1969, when handsome Chase Andrews is found dead, the locals immediately suspect Kya Clark, the so-called Marsh Girl. But Kya is not what they say. Sensitive and intelligent, she has survived for years alone in the marsh that she calls home, finding friends in the gulls and lessons in the sand.",
      "publishedYear": 2018,
      "pages": 384,
      "publisher": "G.P. Putnam's Sons",
      "language": "English",
      "isbn": "978-0735219090",
      "awards": ["Goodreads Choice Award for Fiction (2018)"],
      "themes": [
        "Nature",
        "Isolation",
        "Coming of Age",
        "Love",
        "Prejudice",
        "Survival"
      ],
      "readingTime": "6-8 hours",
      "difficulty": "Easy",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "There are some who can live without wild things, and some who cannot.",
        "Autumn leaves don't fall, they fly. They take their time and wander on this their only chance to soar.",
        "She knew the years of isolation had altered her behavior until she was different from others, but it wasn't her fault she'd been alone."
      ]
    },
    {
      "title": "The Handmaid's Tale",
      "author": "Margaret Atwood",
      "rating": 4.4,
      "reviews": 2100,
      "totalReviews": 2100,
      "image": "https://images.unsplash.com/photo-1543002588-bfa74002ed7e?w=400&h=600&fit=crop",
      "genre": "Dystopian Fiction",
      "description": "A dystopian novel about a totalitarian society where women's rights have been stripped away.",
      "fullDescription": "Set in the near future, it describes life in what was once the United States and is now called the Republic of Gilead, a monotheocracy that has reacted to social unrest and a sharply declining birthrate by reverting to, and going beyond, the repressive intolerance of the original Puritans. The regime takes the Book of Genesis absolutely at its word, with bizarre consequences for the women and men in its population.",
      "publishedYear": 1985,
      "pages": 311,
      "publisher": "McClelland & Stewart",
      "language": "English",
      "isbn": "978-0385490818",
      "awards": [
        "Arthur C. Clarke Award (1987)",
        "Governor General's Award (1985)"
      ],
      "themes": [
        "Feminism",
        "Totalitarianism",
        "Religion",
        "Power",
        "Resistance",
        "Identity"
      ],
      "readingTime": "5-7 hours",
      "difficulty": "Medium",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "Nolite te bastardes carborundorum. Don't let the bastards grind you down.",
        "Better never means better for everyone... It always means worse, for some.",
        "We were the people who were not in the papers. We lived in the blank white spaces at the edges of print."
      ]
    },
    {
      "title": "Becoming",
      "author": "Michelle Obama",
      "rating": 4.8,
      "reviews": 3500,
      "totalReviews": 3500,
      "image": "https://images.unsplash.com/photo-1512820790803-83ca734da794?w=400&h=600&fit=crop",
      "genre": "Biography",
      "description": "An intimate memoir by the former First Lady of the United States.",
      "fullDescription": "In her memoir, a work of deep reflection and mesmerizing storytelling, Michelle Obama invites readers into her world, chronicling the experiences that have shaped her—from her childhood on the South Side of Chicago to her years as an executive balancing the demands of motherhood and work, to her time spent at the world's most famous address. With unerring honesty and lively wit, she describes her triumphs and her disappointments, both public and private.",
      "publishedYear": 2018,
      "pages": 448,
      "publisher": "Crown",
      "language": "English",
      "isbn": "978-1524763138",
      "awards": ["Grammy Award for Best Spoken Word Album (2020)"],
      "themes": [
        "Leadership",
        "Family",
        "Politics",
        "Identity",
        "Empowerment",
        "Service"
      ],
      "readingTime": "8-10 hours",
      "difficulty": "Easy",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "Your story is what you have, what you will always have. It is something to own.",
        "If you don't get out there and define yourself, you'll be quickly and inaccurately defined by others.",
        "Success isn't about how much money you make; it's about the difference you make in people's lives."
      ]
    },
    {
      "title": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "rating": 4.7,
      "reviews": 2600,
      "totalReviews": 2600,
      "image": "https://images.unsplash.com/photo-1481627834876-b7833e8f5570?w=400&h=600&fit=crop",
      "genre": "Fantasy",
      "description": "A classic fantasy adventure about Bilbo Baggins and his unexpected journey.",
      "fullDescription": "In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort. Written for J.R.R. Tolkien's own children, The Hobbit met with instant critical acclaim when it was first published in 1937. Now recognized as a timeless classic, this introduction to the hobbit Bilbo Baggins, the wizard Gandalf, Gollum, and the spectacular world of Middle-earth recounts of the adventures of a reluctant hero.",
      "publishedYear": 1937,
      "pages": 310,
      "publisher": "George Allen & Unwin",
      "language": "English",
      "isbn": "978-0547928227",
      "awards": ["Carnegie Medal (1937)"],
      "themes": [
        "Adventure",
        "Courage",
        "Friendship",
        "Good vs Evil",
        "Home",
        "Growth"
      ],
      "readingTime": "5-7 hours",
      "difficulty": "Easy",
      "ageRating": "All Ages",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "In a hole in the ground there lived a hobbit.",
        "It's the job that's never started as takes longest to finish.",
        "There is nothing like looking, if you want to find something."
      ]
    },
    {
      "title": "Digital Minimalism",
      "author": "Cal Newport",
      "rating": 4.6,
      "reviews": 1560,
      "totalReviews": 1560,
      "image": "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?w=400&h=600&fit=crop",
      "genre": "Technology",
      "description": "Choosing a focused life in a noisy world through digital minimalism.",
      "fullDescription": "Digital Minimalism presents a philosophy for technology use rooted in the belief that clutter is costly and optimization matters. It asks you to be more selective about the digital tools you allow into your life, and then challenges you to optimize how you use them. This process of digital decluttering will help you rediscover the pleasures of the offline world and build a more intentional approach to the technologies you decide are worth your time.",
      "publishedYear": 2019,
      "pages": 304,
      "publisher": "Grand Central Publishing",
      "language": "English",
      "isbn": "978-0525536512",
      "awards": ["New York Times Bestseller"],
      "themes": [
        "Technology",
        "Productivity",
        "Mindfulness",
        "Focus",
        "Digital Wellness",
        "Intentional Living"
      ],
      "readingTime": "5-7 hours",
      "difficulty": "Medium",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "Digital minimalism is a philosophy of technology use in which you focus your online time on a small number of carefully selected and optimized activities.",
        "The sugar high of convenience is fleeting and the sting of missing out dulls, but the meaningful glow that comes from taking charge of what claims your time and attention is something that persists.",
        "Human beings are not wired to be constantly wired."
      ]
    },
    {
      "title": "The Psychology of Money",
      "author": "Morgan Housel",
      "rating": 4.7,
      "reviews": 1800,
      "totalReviews": 1800,
      "image": "https://images.unsplash.com/photo-1589829085413-56de8ae18c73?w=400&h=600&fit=crop",
      "genre": "Finance",
      "description": "Timeless lessons on wealth, greed, and happiness from behavioral psychology.",
      "fullDescription": "Doing well with money isn't necessarily about what you know. It's about how you behave. And behavior is hard to teach, even to really smart people. Money—investing, personal finance, and business decisions—is typically taught as a math-based field, where data and formulas tell us exactly what to do. But in the real world people don't make financial decisions on a spreadsheet. They make them at the dinner table, or in a meeting room, where personal history, your own unique view of the world, ego, pride, marketing, and odd incentives are scrambled together.",
      "publishedYear": 2020,
      "pages": 256,
      "publisher": "Harriman House",
      "language": "English",
      "isbn": "978-0857197689",
      "awards": ["Business Book Awards Winner"],
      "themes": [
        "Finance",
        "Psychology",
        "Investing",
        "Behavior",
        "Wealth",
        "Decision Making"
      ],
      "readingTime": "4-6 hours",
      "difficulty": "Easy",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "Your personal experiences with money make up maybe 0.00000001% of what's happened in the world, but maybe 80% of how you think the world works.",
        "The hardest financial skill is getting the goalpost to stop moving.",
        "Spending money to show people how much money you have is the fastest way to have less money."
      ]
    },
    {
      "title": "Circe",
      "author": "Madeline Miller",
      "rating": 4.6,
      "reviews": 2200,
      "totalReviews": 2200,
      "image": "https://images.unsplash.com/photo-1481627834876-b7833e8f5570?w=400&h=600&fit=crop",
      "genre": "Mythology",
      "description": "A stunning reimagining of the Greek myth of Circe, the witch of Aiaia.",
      "fullDescription": "In the house of Helios, god of the sun and mightiest of the Titans, a daughter is born. But Circe is a strange child—not powerful, like her father, nor viciously alluring like her mother. Turning to the world of mortals for companionship, she discovers that she does possess power—the power of witchcraft, which can transform rivals into monsters and menace the gods themselves. Threatened, Zeus banishes her to a deserted island, where she hones her occult craft, tames wild beasts and crosses paths with many of the most famous figures in Greek mythology.",
      "publishedYear": 2018,
      "pages": 393,
      "publisher": "Little, Brown and Company",
      "language": "English",
      "isbn": "978-0316556347",
      "awards": ["Goodreads Choice Award for Fantasy (2018)"],
      "themes": [
        "Mythology",
        "Feminism",
        "Power",
        "Transformation",
        "Isolation",
        "Love"
      ],
      "readingTime": "6-8 hours",
      "difficulty": "Medium",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "When I was born, the word for what I was did not exist.",
        "But in a solitary life, there are rare moments when another soul dips near yours, as stars once a year brush the earth.",
        "It is a common saying that women are delicate creatures, flowers, eggs, anything that may be crushed in a moment's carelessness. If I had ever believed it, I no longer did."
      ]
    },
    {
      "title": "The Invisible Man",
      "author": "Ralph Ellison",
      "rating": 4.3,
      "reviews": 1900,
      "totalReviews": 1900,
      "image": "https://images.unsplash.com/photo-1543002588-bfa74002ed7e?w=400&h=600&fit=crop",
      "genre": "Literary Fiction",
      "description": "A groundbreaking novel about identity and racism in America.",
      "fullDescription": "This novel is a journey from the South to the North, from the black world to the white world, from the nineteenth century to the twentieth, from innocence to experience, from ignorance to enlightenment, from invisibility to visibility. But it is also a journey from purpose to purpose, each one seemingly more important and meaningful than the last, but each one also merely a stop along the way to the next station. The narrator is 'invisible' because people refuse to see him, and when he is seen, he is never seen as he really is, but only as others want to see him.",
      "publishedYear": 1952,
      "pages": 581,
      "publisher": "Random House",
      "language": "English",
      "isbn": "978-0679732761",
      "awards": ["National Book Award for Fiction (1953)"],
      "themes": [
        "Identity",
        "Racism",
        "Invisibility",
        "Society",
        "Coming of Age",
        "American Dream"
      ],
      "readingTime": "10-12 hours",
      "difficulty": "Hard",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "I am an invisible man. No, I am not a spook like those who haunted Edgar Allan Poe; nor am I one of your Hollywood-movie ectoplasms.",
        "When I discover who I am, I'll be free.",
        "The truth is the light and light is the truth."
      ]
    },
    {
      "title": "Klara and the Sun",
      "author": "Kazuo Ishiguro",
      "rating": 4.2,
      "reviews": 1400,
      "totalReviews": 1400,
      "image": "https://images.unsplash.com/photo-1446776653964-20c1d3a81b06?w=400&h=600&fit=crop",
      "genre": "Science Fiction",
      "description": "A moving story about love, sacrifice, and what it means to be human, told from the perspective of an artificial friend.",
      "fullDescription": "Klara and the Sun is a thrilling book that offers a look at our changing world through the eyes of an unforgettable narrator, and one that explores the fundamental question: what does it mean to love? From her place in the store, Klara, an artificial friend with outstanding observational qualities, watches carefully the behavior of those who come in to browse, and of those who pass on the street outside. She remains hopeful that a customer will soon choose her, but when the possibility emerges that her circumstances may change forever, Klara is warned not to invest too much in the promises of humans.",
      "publishedYear": 2021,
      "pages": 303,
      "publisher": "Knopf",
      "language": "English",
      "isbn": "978-0593318171",
      "awards": ["Booker Prize Longlist (2021)"],
      "themes": [
        "Artificial Intelligence",
        "Love",
        "Sacrifice",
        "Humanity",
        "Technology",
        "Friendship"
      ],
      "readingTime": "5-7 hours",
      "difficulty": "Medium",
      "ageRating": "Adult",
      "format": ["Hardcover", "Paperback", "eBook", "Audiobook"],
      "quotes": [
        "There was something very special, but it wasn't inside Josie. It was inside those who loved her.",
        "Perhaps all humans are lonely. At least potentially.",
        "I believe I have many feelings. The more I observe, the more feelings become available to me."
      ]
    }
  ],
  "totalBooks": 20
}
